Revit 2026 API

# DuplicateTypeAction Enumeration

---

This enumerated type defines the action to be taken when there are types with the same name being pasted.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DuplicateTypeAction
```
```vb
Public Enumeration DuplicateTypeAction
```
```cpp
public enum class DuplicateTypeAction
```
```fsharp
type DuplicateTypeAction
```

| Member name | Value | Description |
| --- | --- | --- |
| Abort | 2 | Cancel the paste operation. |
| UseDestinationTypes | 1 | Proceed with the paste operation and use the types with the same name in the destination document. |

#### Reference

Autodesk.Revit.DB Namespace